app/controllers/api/sessions_controller.rb

  def create #fix5
    @user = params[:user][:username] ? User.find_by_credentials(
       params[:user][:username],
      params[:user][:password]
    ) : User.find_by_credentials(
      params[:user][:email],
      params[:user][:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "paulpaul@gmail.com"], ["LIMIT", 1]]